### Pandas_处理丢失数据

#### 创建矩阵（NaN两个位置）

In [43]:
import numpy as np
import pandas as pd

dates = pd.date_range("20130101",periods = 6)
df = pd.DataFrame(np.arange(24).reshape((6,4)),index = dates, columns = ["A","B","C","D"])
df.iloc[0,1]=np.nan
df.iloc[1,2]=np.nan
print(df)

             A     B     C   D
2013-01-01   0   NaN   2.0   3
2013-01-02   4   5.0   NaN   7
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

#### 去掉有NaN的行

In [45]:
df.dropna(
    axis = 0,     #0是对行操作 1是对列操作
    how = 'any'   #any有一个NaN存在就去掉 all全部是NaN才去掉
)

             A     B     C   D
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

#### 用其他值代替NaN（如0）

In [50]:
df.fillna(value=0)

             A     B     C   D
2013-01-01   0   0.0   2.0   3
2013-01-02   4   5.0   0.0   7
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

#### 判断是否有缺失值

In [58]:
np.any(df.isnull()) == True

True

In [59]:
df.isnull()

                A      B      C      D
2013-01-01  False   True  False  False
2013-01-02  False  False   True  False
2013-01-03  False  False  False  False
2013-01-04  False  False  False  False
2013-01-05  False  False  False  False
2013-01-06  False  False  False  False